In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
df1 = DataFrame(np.random.randn(5,4))
df1

          0         1         2         3
0 -0.789066  1.617567 -0.837682  0.127371
1  1.054239 -2.158583  1.345036 -0.090196
2 -2.606991  0.395470 -0.856755  0.099858
3 -0.126434  0.342470 -0.352883  0.659212
4  0.701326 -0.597288 -0.343737 -1.849545

In [4]:
df1.describe()

              0         1         2         3
count  5.000000  5.000000  5.000000  5.000000
mean  -0.353385 -0.080073 -0.209205 -0.210660
std    1.450335  1.403066  0.903979  0.957577
min   -2.606991 -2.158583 -0.856755 -1.849545
25%   -0.789066 -0.597288 -0.837682 -0.090196
50%   -0.126434  0.342470 -0.352883  0.099858
75%    0.701326  0.395470 -0.343737  0.127371
max    1.054239  1.617567  1.345036  0.659212

In [9]:
col1 = df1[0]

In [10]:
np.abs(col1)>1

0    False
1     True
2     True
3    False
4    False
Name: 0, dtype: bool

In [11]:
col1[np.abs(col1)>1]

1    1.054239
2   -2.606991
Name: 0, dtype: float64

In [19]:
df1[(np.abs(df1)>1).any(1)]

          0         1         2         3
0 -0.789066  1.617567 -0.837682  0.127371
1  1.054239 -2.158583  1.345036 -0.090196
2 -2.606991  0.395470 -0.856755  0.099858
4  0.701326 -0.597288 -0.343737 -1.849545

In [20]:
df1[np.abs(df1)>1] = np.sign(df1)*1

In [21]:
df1

          0         1         2         3
0 -0.789066  1.000000 -0.837682  0.127371
1  1.000000 -1.000000  1.000000 -0.090196
2 -1.000000  0.395470 -0.856755  0.099858
3 -0.126434  0.342470 -0.352883  0.659212
4  0.701326 -0.597288 -0.343737 -1.000000

In [23]:
df1.describe() # we have capped the values that are more than 1 to 1.

              0         1         2         3
count  5.000000  5.000000  5.000000  5.000000
mean  -0.042835  0.028130 -0.278212 -0.040751
std    0.883359  0.810321  0.756871  0.604274
min   -1.000000 -1.000000 -0.856755 -1.000000
25%   -0.789066 -0.597288 -0.837682 -0.090196
50%   -0.126434  0.342470 -0.352883  0.099858
75%    0.701326  0.395470 -0.343737  0.127371
max    1.000000  1.000000  1.000000  0.659212